app/middleware/tenant_switcher.rb

SELECT "companies".* FROM "companies" WHERE "companies"."subdomain" = $1 LIMIT $2  [["subdomain", "volopay"], ["LIMIT", 1]]
---
  def switch_schema(company_id)
    set_public_schema

    company = Company.find_by(subdomain: company_id)