app/controllers/api/v1/approvals_controller.rb

SELECT "approvals".* FROM "approvals"
---
      def index
        render json: Approval.all

INSERT INTO "approvals" ("expense_id", "approver_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["expense_id", 2], ["approver_id", 3], ["status", "approved"], ["created_at", "2026-02-19 11:38:11.536193"], ["updated_at", "2026-02-19 11:38:11.536193"]]
---
      def create
        approval = Approval.new(approval_params)
        if approval.save

UPDATE "approvals" SET "status" = $1, "updated_at" = $2 WHERE "approvals"."id" = $3  [["status", "reject"], ["updated_at", "2026-02-19 11:38:35.666473"], ["id", 1]]
---
      def update
        if @approval.update(approval_params)

DELETE FROM "approvals" WHERE "approvals"."id" = $1  [["id", 1]]
---
      def destroy
        @approval.destroy

SELECT "approvals".* FROM "approvals" WHERE "approvals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def set_approval
        @approval = Approval.find(params[:id])