app/controllers/api/v1/categories_controller.rb

      def index
        render json: Category.all
---
SELECT "categories".* FROM "categories"

      def create
        category = Category.new(category_params)
        if category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Travel"], ["created_at", "2026-02-19 11:20:39.622211"], ["updated_at", "2026-02-19 11:20:39.622211"]]

      def update
        if @category.update(category_params)
---
UPDATE "categories" SET "name" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["name", "Traveling"], ["updated_at", "2026-02-19 11:23:13.853157"], ["id", 1]]

      def destroy
        @category.destroy
---
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 2]]

      def set_category
        @category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]