app/controllers/api/v1/companies_controller.rb

      def index
        render json: Company.all
---
SELECT "public"."companies".* FROM "public"."companies"

      def create
        company = Company.new(company_params)

        begin
          Company.transaction do
            company.save!  # Raises exception if validation fails
---
INSERT INTO "companies" ("name", "subdomain", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Company One"], ["subdomain", "company1"], ["created_at", "2026-02-20 17:54:50.493675"], ["updated_at", "2026-02-20 17:54:50.493675"]]

      def destroy
        company = Company.find(params[:id])
        company.destroy
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "companies" WHERE "companies"."id" = $1  [["id", 3]]