app/controllers/api/v1/transactions_controller.rb

      def index
        render json: Transaction.all
---
SELECT "transactions".* FROM "transactions"

      def create
        transaction = Transaction.new(transaction_params)
        if transaction.save
---
INSERT INTO "transactions" ("amount", "transaction_type", "account_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["amount", "1500.0"], ["transaction_type", "debit"], ["account_id", 2], ["created_at", "2026-02-19 11:42:46.177552"], ["updated_at", "2026-02-19 11:42:46.177552"]]

      def destroy
        @transaction.destroy
---
DELETE FROM "transactions" WHERE "transactions"."id" = $1  [["id", 1]]

      def set_transaction
        @transaction = Transaction.find(params[:id])
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]