app/controllers/api/v1/users_controller.rb

      def index
        render json: User.all
---
SELECT "users".* FROM "users"

      def create
        user = User.new(user_params)
        if user.save
---
INSERT INTO "users" ("name", "email", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Srinivas"], ["email", "sri@abc.com"], ["role", "admin"], ["created_at", "2026-02-20 17:58:21.531294"], ["updated_at", "2026-02-20 17:58:21.531294"]]

      def update
        if @user.update(user_params)
---
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Srinivas Reddy"], ["updated_at", "2026-02-19 11:09:19.907858"], ["id", 1]]

      def destroy
        @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]

      def set_user
        @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]